Tekla Open API Reference for Tekla Structures 2025
WpfShapeCatalog Constructor
 Initializes a new instance of the ShapeCatalog class.
 Namespace: Tekla.Structures.Dialog.UIControls
 Assembly: Tekla.Structures.Dialog (in Tekla.Structures.Dialog.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public WpfShapeCatalog()
Public Sub New
See Also
Reference
WpfShapeCatalog Class
WpfShapeCatalog Overload
Tekla.Structures.Dialog.UIControls Namespace